In [10]:
#multiindex
#mesela iki dizinin karakterlerininin bazı özellikleri tutulsun
import numpy as np
import pandas as pd

In [11]:
firstIndex=["simpson","simpson","simpson","south park","south park","south park"]
secondIndex=["homer","bart","marge","cartman","kenny","kylerr"]

In [12]:
fullIndex=list(zip(firstIndex,secondIndex))
fullIndex

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('south park', 'cartman'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [13]:
fullIndex= pd.MultiIndex.from_tuples(fullIndex)

In [14]:
fullIndex

MultiIndex([(   'simpson',   'homer'),
            (   'simpson',    'bart'),
            (   'simpson',   'marge'),
            ('south park', 'cartman'),
            ('south park',   'kenny'),
            ('south park',    'kyle')],
           )

In [28]:

list1=[["a",1],["b",2],["c",3],["d",4],["e",5],["f",6]]
arr=np.array(list1)

In [30]:
df=pd.DataFrame(arr,index=fullIndex,columns=["yas", "meslek"])
df
df[0]

                   yas meslek
film adi   names
simpson    homer     a      1
           bart      b      2
           marge     c      3
south park cartman   d      4
           kenny     e      5
           kyle      f      6

In [31]:
df.loc["south park"]

        yas meslek
names
cartman   d      4
kenny     e      5
kyle      f      6

In [33]:
df.loc["south park"]["yas"]

names
cartman    d
kenny      e
kyle       f
Name: yas, dtype: object

In [34]:
df.loc["south park"].loc["kenny"]

yas       e
meslek    5
Name: kenny, dtype: object

In [20]:
df.index.names=["film adi","names"]
df

                   yas meslek
film adi   names
simpson    homer    10      a
           bart     20      b
           marge    30      c
south park cartman  40      d
           kenny    50      e
           kyle     60      f

In [38]:
df.set_index("meslek")

       yas
meslek
1        a
2        b
3        c
4        d
5        e
6        f